TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_aux_sysif.h
// AON_BATMON Battery Voltage Value
#define AUX_SYSIF_O_BATMONBAT                                       0x00000094

// AON_BATMON Temperature Value
#define AUX_SYSIF_O_BATMONTEMP                                      0x0000009C

// Timer Halt
#define AUX_SYSIF_O_TIMERHALT                                       0x000000A0

// AUX_TIMER2 Bridge
#define AUX_SYSIF_O_TIMER2BRIDGE                                    0x000000B0

// Software Power Profiler
#define AUX_SYSIF_O_SWPWRPROF                                       0x000000B4

//*****************************************************************************
//
// Register: AUX_SYSIF_O_OPMODEREQ
//
//*****************************************************************************
// Field:   [1:0] REQ
//
// AUX operational mode request.
// ENUMs:
// PDLP                     Powerdown operational mode with wakeup to lowpower
//                          mode, characterized by:
//                          - Powerdown system power
//                          supply state (uLDO) request.
//                          -
//                          AON_PMCTL:AUXSCECLK.PD_SRC sets the SCE clock
//                          frequency (SCE_RATE).
//                          - An active wakeup flag
//                          overrides the operational mode externally to
//                          lowpower (LP) as long as the flag is set.
// PDA                      Powerdown operational mode with wakeup to active
//                          mode, characterized by:
//                          - Powerdown system power
//                          supply state (uLDO) request.
//                          -
//                          AON_PMCTL:AUXSCECLK.PD_SRC sets the SCE clock
//                          frequency (SCE_RATE).
//                          - An active wakeup flag
//                          overrides the operational mode externally to
//                          active (A) as long as the flag is set.
// LP                       Lowpower operational mode, characterized by:
//                          - Powerdown system power
//                          supply state (uLDO) request.
//                          - SCE clock frequency
//                          (SCE_RATE) equals SCLK_MF.
//                          - An active wakeup flag
//                          does not change operational mode.
// A                        Active operational mode, characterized by:
//                          - Active system power
//                          supply state (GLDO or DCDC) request.
//                          - AON_PMCTL:AUXSCECLK.SRC
//                          sets the SCE clock frequency (SCE_RATE).
//                          - An active wakeup flag
//                          does not change operational mode.
#define AUX_SYSIF_OPMODEREQ_REQ_W                                            2
#define AUX_SYSIF_OPMODEREQ_REQ_M                                   0x00000003
#define AUX_SYSIF_OPMODEREQ_REQ_S                                            0
#define AUX_SYSIF_OPMODEREQ_REQ_PDLP                                0x00000003
#define AUX_SYSIF_OPMODEREQ_REQ_PDA                                 0x00000002
#define AUX_SYSIF_OPMODEREQ_REQ_LP                                  0x00000001
#define AUX_SYSIF_OPMODEREQ_REQ_A                                   0x00000000

//*****************************************************************************
//
// Register: AUX_SYSIF_O_OPMODEACK
//
//*****************************************************************************
// Field:   [1:0] ACK
//
// AUX operational mode acknowledgement.
// ENUMs:
// PDLP                     Powerdown operational mode with wakeup to lowpower
//                          mode is acknowledged.
// PDA                      Powerdown operational mode with wakeup to active
//                          mode is acknowledged.
// LP                       Lowpower operational mode is acknowledged.
// A                        Active operational mode is acknowledged.
#define AUX_SYSIF_OPMODEACK_ACK_W                                            2
#define AUX_SYSIF_OPMODEACK_ACK_M                                   0x00000003
#define AUX_SYSIF_OPMODEACK_ACK_S                                            0
#define AUX_SYSIF_OPMODEACK_ACK_PDLP                                0x00000003
#define AUX_SYSIF_OPMODEACK_ACK_PDA                                 0x00000002
#define AUX_SYSIF_OPMODEACK_ACK_LP                                  0x00000001
#define AUX_SYSIF_OPMODEACK_ACK_A                                   0x00000000

//*****************************************************************************
//
// Register: AUX_SYSIF_O_PROGWU0CFG
//
//*****************************************************************************
// Field:     [7] POL
//
// Polarity of WU_SRC.
//
// The procedure used to clear the wakeup flag decides level or edge
// sensitivity, see WUFLAGSCLR.PROG_WU0.
// ENUMs:
// LOW                      The wakeup flag is set when WU_SRC is low or goes
//                          low.
// HIGH                     The wakeup flag is set when WU_SRC is high or goes
//                          high.
#define AUX_SYSIF_PROGWU0CFG_POL                                    0x00000080
#define AUX_SYSIF_PROGWU0CFG_POL_BITN                                        7
#define AUX_SYSIF_PROGWU0CFG_POL_M                                  0x00000080
#define AUX_SYSIF_PROGWU0CFG_POL_S                                           7
#define AUX_SYSIF_PROGWU0CFG_POL_LOW                                0x00000080
#define AUX_SYSIF_PROGWU0CFG_POL_HIGH                               0x00000000

// Field:     [6] EN
//
// Programmable wakeup flag enable.
//
// 0: Disable wakeup flag.
// 1: Enable wakeup flag.
#define AUX_SYSIF_PROGWU0CFG_EN                                     0x00000040
#define AUX_SYSIF_PROGWU0CFG_EN_BITN                                         6
#define AUX_SYSIF_PROGWU0CFG_EN_M                                   0x00000040
#define AUX_SYSIF_PROGWU0CFG_EN_S                                            6

// Field:   [5:0] WU_SRC
//
// Wakeup source from the asynchronous AUX event bus.
//
// Only change WU_SRC when EN is 0 or WUFLAGSCLR.PROG_WU0 is 1.
//
// If you write a non-enumerated value the behavior is identical to NO_EVENT.
// The written value is returned when read.
// ENUMs:
// NO_EVENT                 No event.
// AUX_SMPH_AUTOTAKE_DONE   AUX_EVCTL:EVSTAT3.AUX_SMPH_AUTOTAKE_DONE
// AUX_ADC_FIFO_NOT_EMPTY   AUX_EVCTL:EVSTAT3.AUX_ADC_FIFO_NOT_EMPTY
// AUX_ADC_FIFO_ALMOST_FULL AUX_EVCTL:EVSTAT3.AUX_ADC_FIFO_ALMOST_FULL
// AUX_ADC_IRQ              AUX_EVCTL:EVSTAT3.AUX_ADC_IRQ
// AUX_ADC_DONE             AUX_EVCTL:EVSTAT3.AUX_ADC_DONE
// AUX_ISRC_RESET_N         AUX_EVCTL:EVSTAT3.AUX_ISRC_RESET_N
// AUX_TDC_DONE             AUX_EVCTL:EVSTAT3.AUX_TDC_DONE
// AUX_TIMER0_EV            AUX_EVCTL:EVSTAT3.AUX_TIMER0_EV
// AUX_TIMER1_EV            AUX_EVCTL:EVSTAT3.AUX_TIMER1_EV
// AUX_TIMER2_PULSE         AUX_EVCTL:EVSTAT3.AUX_TIMER2_PULSE
// AUX_TIMER2_EV3           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV3
// AUX_TIMER2_EV2           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV2
// AUX_TIMER2_EV1           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV1
// AUX_TIMER2_EV0           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0
// AUX_COMPB                AUX_EVCTL:EVSTAT2.AUX_COMPB
// AUX_COMPA                AUX_EVCTL:EVSTAT2.AUX_COMPA
// MCU_OBSMUX1              AUX_EVCTL:EVSTAT2.MCU_OBSMUX1
// MCU_OBSMUX0              AUX_EVCTL:EVSTAT2.MCU_OBSMUX0
// MCU_EV                   AUX_EVCTL:EVSTAT2.MCU_EV
// ACLK_REF                 AUX_EVCTL:EVSTAT2.ACLK_REF
// VDDR_RECHARGE            AUX_EVCTL:EVSTAT2.VDDR_RECHARGE
// MCU_ACTIVE               AUX_EVCTL:EVSTAT2.MCU_ACTIVE
// PWR_DWN                  AUX_EVCTL:EVSTAT2.PWR_DWN
// SCLK_LF                  AUX_EVCTL:EVSTAT2.SCLK_LF
// AON_BATMON_TEMP_UPD      AUX_EVCTL:EVSTAT2.AON_BATMON_TEMP_UPD
// AON_BATMON_BAT_UPD       AUX_EVCTL:EVSTAT2.AON_BATMON_BAT_UPD
// AON_RTC_4KHZ             AUX_EVCTL:EVSTAT2.AON_RTC_4KHZ
// AON_RTC_CH2_DLY          AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY
// AON_RTC_CH2              AUX_EVCTL:EVSTAT2.AON_RTC_CH2
// MANUAL_EV                AUX_EVCTL:EVSTAT2.MANUAL_EV
// AUXIO31                  AUX_EVCTL:EVSTAT1.AUXIO31
// AUXIO30                  AUX_EVCTL:EVSTAT1.AUXIO30
// AUXIO29                  AUX_EVCTL:EVSTAT1.AUXIO29
// AUXIO28                  AUX_EVCTL:EVSTAT1.AUXIO28
// AUXIO27                  AUX_EVCTL:EVSTAT1.AUXIO27
// AUXIO26                  AUX_EVCTL:EVSTAT1.AUXIO26
// AUXIO25                  AUX_EVCTL:EVSTAT1.AUXIO25
// AUXIO24                  AUX_EVCTL:EVSTAT1.AUXIO24
// AUXIO23                  AUX_EVCTL:EVSTAT1.AUXIO23
// AUXIO22                  AUX_EVCTL:EVSTAT1.AUXIO22
// AUXIO21                  AUX_EVCTL:EVSTAT1.AUXIO21
// AUXIO20                  AUX_EVCTL:EVSTAT1.AUXIO20
// AUXIO19                  AUX_EVCTL:EVSTAT1.AUXIO19
// AUXIO18                  AUX_EVCTL:EVSTAT1.AUXIO18
// AUXIO17                  AUX_EVCTL:EVSTAT1.AUXIO17
// AUXIO16                  AUX_EVCTL:EVSTAT1.AUXIO16
// AUXIO15                  AUX_EVCTL:EVSTAT0.AUXIO15
// AUXIO14                  AUX_EVCTL:EVSTAT0.AUXIO14
// AUXIO13                  AUX_EVCTL:EVSTAT0.AUXIO13
// AUXIO12                  AUX_EVCTL:EVSTAT0.AUXIO12
// AUXIO11                  AUX_EVCTL:EVSTAT0.AUXIO11
// AUXIO10                  AUX_EVCTL:EVSTAT0.AUXIO10
// AUXIO9                   AUX_EVCTL:EVSTAT0.AUXIO9
// AUXIO8                   AUX_EVCTL:EVSTAT0.AUXIO8
// AUXIO7                   AUX_EVCTL:EVSTAT0.AUXIO7
// AUXIO6                   AUX_EVCTL:EVSTAT0.AUXIO6
// AUXIO5                   AUX_EVCTL:EVSTAT0.AUXIO5
// AUXIO4                   AUX_EVCTL:EVSTAT0.AUXIO4
// AUXIO3                   AUX_EVCTL:EVSTAT0.AUXIO3
// AUXIO2                   AUX_EVCTL:EVSTAT0.AUXIO2
// AUXIO1                   AUX_EVCTL:EVSTAT0.AUXIO1
// AUXIO0                   AUX_EVCTL:EVSTAT0.AUXIO0
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_W                                        6
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_M                               0x0000003F
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_S                                        0
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_NO_EVENT                        0x0000003F
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_SMPH_AUTOTAKE_DONE          0x0000003D
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_ADC_FIFO_NOT_EMPTY          0x0000003C
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_ADC_FIFO_ALMOST_FULL        0x0000003B
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_ADC_IRQ                     0x0000003A
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_ADC_DONE                    0x00000039
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_ISRC_RESET_N                0x00000038
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_TDC_DONE                    0x00000037
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_TIMER0_EV                   0x00000036
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_TIMER1_EV                   0x00000035
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_TIMER2_PULSE                0x00000034
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_TIMER2_EV3                  0x00000033
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_TIMER2_EV2                  0x00000032
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_TIMER2_EV1                  0x00000031
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_TIMER2_EV0                  0x00000030
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_COMPB                       0x0000002F
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_COMPA                       0x0000002E
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_MCU_OBSMUX1                     0x0000002D
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_MCU_OBSMUX0                     0x0000002C
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_MCU_EV                          0x0000002B
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_ACLK_REF                        0x0000002A
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_VDDR_RECHARGE                   0x00000029
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_MCU_ACTIVE                      0x00000028
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_PWR_DWN                         0x00000027
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_SCLK_LF                         0x00000026
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AON_BATMON_TEMP_UPD             0x00000025
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AON_BATMON_BAT_UPD              0x00000024
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AON_RTC_4KHZ                    0x00000023
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AON_RTC_CH2_DLY                 0x00000022
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AON_RTC_CH2                     0x00000021
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_MANUAL_EV                       0x00000020
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO31                         0x0000001F
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO30                         0x0000001E
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO29                         0x0000001D
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO28                         0x0000001C
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO27                         0x0000001B
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO26                         0x0000001A
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO25                         0x00000019
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO24                         0x00000018
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO23                         0x00000017
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO22                         0x00000016
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO21                         0x00000015
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO20                         0x00000014
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO19                         0x00000013
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO18                         0x00000012
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO17                         0x00000011
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO16                         0x00000010
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO15                         0x0000000F
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO14                         0x0000000E
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO13                         0x0000000D
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO12                         0x0000000C
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO11                         0x0000000B
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO10                         0x0000000A
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO9                          0x00000009
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO8                          0x00000008
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO7                          0x00000007
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO6                          0x00000006
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO5                          0x00000005
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO4                          0x00000004
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO3                          0x00000003
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO2                          0x00000002
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO1                          0x00000001
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO0                          0x00000000

//*****************************************************************************
//
// Register: AUX_SYSIF_O_PROGWU1CFG
//
//*****************************************************************************
// Field:     [7] POL
//
// Polarity of WU_SRC.
//
// The procedure used to clear the wakeup flag decides level or edge
// sensitivity, see WUFLAGSCLR.PROG_WU1.
// ENUMs:
// LOW                      The wakeup flag is set when WU_SRC is low or goes
//                          low.
// HIGH                     The wakeup flag is set when WU_SRC is high or goes
//                          high.
#define AUX_SYSIF_PROGWU1CFG_POL                                    0x00000080
#define AUX_SYSIF_PROGWU1CFG_POL_BITN                                        7
#define AUX_SYSIF_PROGWU1CFG_POL_M                                  0x00000080
#define AUX_SYSIF_PROGWU1CFG_POL_S                                           7
#define AUX_SYSIF_PROGWU1CFG_POL_LOW                                0x00000080
#define AUX_SYSIF_PROGWU1CFG_POL_HIGH                               0x00000000

// Field:     [6] EN
//
// Programmable wakeup flag enable.
//
// 0: Disable wakeup flag.
// 1: Enable wakeup flag.
#define AUX_SYSIF_PROGWU1CFG_EN                                     0x00000040
#define AUX_SYSIF_PROGWU1CFG_EN_BITN                                         6
#define AUX_SYSIF_PROGWU1CFG_EN_M                                   0x00000040
#define AUX_SYSIF_PROGWU1CFG_EN_S                                            6

