TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_aux_sysif.h
// Field:     [0] SW_WU0
//
// Software wakeup 0 trigger.
//
// 0: No effect.
// 1: Set WUFLAGS.SW_WU0 and trigger AUX wakeup.
#define AUX_SYSIF_SWWUTRIG_SW_WU0                                   0x00000001
#define AUX_SYSIF_SWWUTRIG_SW_WU0_BITN                                       0
#define AUX_SYSIF_SWWUTRIG_SW_WU0_M                                 0x00000001
#define AUX_SYSIF_SWWUTRIG_SW_WU0_S                                          0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_WUFLAGS
//
//*****************************************************************************
// Field:     [7] SW_WU3
//
// Software wakeup 3 flag.
//
// 0: Software wakeup 3 not triggered.
// 1: Software wakeup 3 triggered.
#define AUX_SYSIF_WUFLAGS_SW_WU3                                    0x00000080
#define AUX_SYSIF_WUFLAGS_SW_WU3_BITN                                        7
#define AUX_SYSIF_WUFLAGS_SW_WU3_M                                  0x00000080
#define AUX_SYSIF_WUFLAGS_SW_WU3_S                                           7

// Field:     [6] SW_WU2
//
// Software wakeup 2 flag.
//
// 0: Software wakeup 2 not triggered.
// 1: Software wakeup 2 triggered.
#define AUX_SYSIF_WUFLAGS_SW_WU2                                    0x00000040
#define AUX_SYSIF_WUFLAGS_SW_WU2_BITN                                        6
#define AUX_SYSIF_WUFLAGS_SW_WU2_M                                  0x00000040
#define AUX_SYSIF_WUFLAGS_SW_WU2_S                                           6

// Field:     [5] SW_WU1
//
// Software wakeup 1 flag.
//
// 0: Software wakeup 1 not triggered.
// 1: Software wakeup 1 triggered.
#define AUX_SYSIF_WUFLAGS_SW_WU1                                    0x00000020
#define AUX_SYSIF_WUFLAGS_SW_WU1_BITN                                        5
#define AUX_SYSIF_WUFLAGS_SW_WU1_M                                  0x00000020
#define AUX_SYSIF_WUFLAGS_SW_WU1_S                                           5

// Field:     [4] SW_WU0
//
// Software wakeup 0 flag.
//
// 0: Software wakeup 0 not triggered.
// 1: Software wakeup 0 triggered.
#define AUX_SYSIF_WUFLAGS_SW_WU0                                    0x00000010
#define AUX_SYSIF_WUFLAGS_SW_WU0_BITN                                        4
#define AUX_SYSIF_WUFLAGS_SW_WU0_M                                  0x00000010
#define AUX_SYSIF_WUFLAGS_SW_WU0_S                                           4

// Field:     [3] PROG_WU3
//
// Programmable wakeup 3.
//
// 0: Programmable wakeup 3 not triggered.
// 1: Programmable wakeup 3 triggered.
#define AUX_SYSIF_WUFLAGS_PROG_WU3                                  0x00000008
#define AUX_SYSIF_WUFLAGS_PROG_WU3_BITN                                      3
#define AUX_SYSIF_WUFLAGS_PROG_WU3_M                                0x00000008
#define AUX_SYSIF_WUFLAGS_PROG_WU3_S                                         3

// Field:     [2] PROG_WU2
//
// Programmable wakeup 2.
//
// 0: Programmable wakeup 2 not triggered.
// 1: Programmable wakeup 2 triggered.
#define AUX_SYSIF_WUFLAGS_PROG_WU2                                  0x00000004
#define AUX_SYSIF_WUFLAGS_PROG_WU2_BITN                                      2
#define AUX_SYSIF_WUFLAGS_PROG_WU2_M                                0x00000004
#define AUX_SYSIF_WUFLAGS_PROG_WU2_S                                         2

// Field:     [1] PROG_WU1
//
// Programmable wakeup 1.
//
// 0: Programmable wakeup 1 not triggered.
// 1: Programmable wakeup 1 triggered.
#define AUX_SYSIF_WUFLAGS_PROG_WU1                                  0x00000002
#define AUX_SYSIF_WUFLAGS_PROG_WU1_BITN                                      1
#define AUX_SYSIF_WUFLAGS_PROG_WU1_M                                0x00000002
#define AUX_SYSIF_WUFLAGS_PROG_WU1_S                                         1

// Field:     [0] PROG_WU0
//
// Programmable wakeup 0.
//
// 0: Programmable wakeup 0 not triggered.
// 1: Programmable wakeup 0 triggered.
#define AUX_SYSIF_WUFLAGS_PROG_WU0                                  0x00000001
#define AUX_SYSIF_WUFLAGS_PROG_WU0_BITN                                      0
#define AUX_SYSIF_WUFLAGS_PROG_WU0_M                                0x00000001
#define AUX_SYSIF_WUFLAGS_PROG_WU0_S                                         0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_WUFLAGSCLR
//
//*****************************************************************************
// Field:     [7] SW_WU3
//
// Clear software wakeup flag 3.
//
// 0: No effect.
// 1: Clear WUFLAGS.SW_WU3. Keep high until WUFLAGS.SW_WU3 is 0.
#define AUX_SYSIF_WUFLAGSCLR_SW_WU3                                 0x00000080
#define AUX_SYSIF_WUFLAGSCLR_SW_WU3_BITN                                     7
#define AUX_SYSIF_WUFLAGSCLR_SW_WU3_M                               0x00000080
#define AUX_SYSIF_WUFLAGSCLR_SW_WU3_S                                        7

// Field:     [6] SW_WU2
//
// Clear software wakeup flag 2.
//
// 0: No effect.
// 1: Clear WUFLAGS.SW_WU2. Keep high until WUFLAGS.SW_WU2 is 0.
#define AUX_SYSIF_WUFLAGSCLR_SW_WU2                                 0x00000040
#define AUX_SYSIF_WUFLAGSCLR_SW_WU2_BITN                                     6
#define AUX_SYSIF_WUFLAGSCLR_SW_WU2_M                               0x00000040
#define AUX_SYSIF_WUFLAGSCLR_SW_WU2_S                                        6

// Field:     [5] SW_WU1
//
// Clear software wakeup flag 1.
//
// 0: No effect.
// 1: Clear WUFLAGS.SW_WU1. Keep high until WUFLAGS.SW_WU1 is 0.
#define AUX_SYSIF_WUFLAGSCLR_SW_WU1                                 0x00000020
#define AUX_SYSIF_WUFLAGSCLR_SW_WU1_BITN                                     5
#define AUX_SYSIF_WUFLAGSCLR_SW_WU1_M                               0x00000020
#define AUX_SYSIF_WUFLAGSCLR_SW_WU1_S                                        5

